{
  "rooms": [
    {
      "room": "balcony",
      "position": "southwest",
      "dimensions": {},
      "adjacent_rooms": [
        "living room"
      ],
      "directions": [
        "southwest",
        "north"
      ]
    },
    {
      "room": "bathroom",
      "position": "east",
      "dimensions": {},
      "adjacent_rooms": [
        "common room",
        "master room",
        "living room"
      ],
      "directions": [
        "east",
        "north",
        "south",
        "west"
      ]
    },
    {
      "room": "common room",
      "position": "east",
      "dimensions": {},
      "adjacent_rooms": [
        "common room",
        "bathroom",
        "living room"
      ],
      "directions": [
        "east",
        "north",
        "northeast",
        "south",
        "west",
        "southwest"
      ]
    },
    {
      "room": "common room",
      "position": "northeast",
      "dimensions": {},
      "adjacent_rooms": [
        "common room",
        "living room",
        "kitchen"
      ],
      "directions": [
        "northeast",
        "south",
        "southwest",
        "west"
      ]
    },
    {
      "room": "kitchen",
      "position": "northwest",
      "dimensions": {},
      "adjacent_rooms": [
        "living room"
      ],
      "directions": [
        "northwest",
        "east",
        "south"
      ]
    },
    {
      "room": "living room",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "kitchen",
        "common room",
        "common room",
        "bathroom",
        "balcony"
      ],
      "directions": [
        "west",
        "north",
        "east",
        "south"
      ]
    },
    {
      "room": "master room",
      "position": "northeast",
      "dimensions": {},
      "adjacent_rooms": [
        "bathroom",
        "living room"
      ],
      "directions": [
        "northeast",
        "north",
        "west",
        "north",
        "west"
      ]
    }
  ],
  "total_rooms": 7,
  "raw_text": "The balcony is in the southwest corner with the living room to the north. It is approximately 12 feet wide by 5 feet high, giving it a square footage of 60. The bathroom is on the east side, with common room 1 to the north, the master room to the south, and the living room to the west. It is approximately 8 feet wide by 8 feet high, giving it a square footage of 64. Common room 1 is on the east side, with common room 2 to the north and exterior walls on the northeast corner, the bathroom to the south and the living room the west and southwest. It is approximately 12 feet wide by 10 feet high, giving it a square footage of 120. Common room 2 is in the northeast corner with common room 1 to the south, the living room to the southwest corner and the kitchen to the west. It is approximately 10 feet wide by 10 feet high, giving it a square footage of 100. the kitchen is in the northwest corner, with common area 2 to the east and the living room to the south. It is approximately 8 feet wide by 12 feet high, giving it a square footage of 96. The living room is on the west side with the kitchen and common room 2 to the north, common room 1, the bathroom and the master to the east and a balcony to the south. It is approximately 15 feet wide by 30 feet high, giving it a square footage of 450. the master room is in the northeast corner, with the bathroom to the north and the living room to the west and north west. It is approximately 10 feet wide by 10 feet high, giving it a square footage of 100.",
  "total_square_footage": 0,
  "id": "12462",
  "source_annotation": "data/raw/annotations/12462.txt",
  "source_image": "data/raw/images/12462.png"
}