{
  "rooms": [
    {
      "room": "balcony",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "living room"
      ],
      "directions": [
        "north",
        "north"
      ]
    },
    {
      "room": "bathroom",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "living room",
        "kitchen",
        "common room"
      ],
      "directions": [
        "south",
        "south",
        "north",
        "west"
      ]
    },
    {
      "room": "common room",
      "position": "east",
      "dimensions": {},
      "adjacent_rooms": [
        "living room",
        "master bedroom"
      ],
      "directions": [
        "east",
        "east",
        "south"
      ]
    },
    {
      "room": "kitchen",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "living room",
        "bathroom"
      ],
      "directions": [
        "south",
        "south",
        "south"
      ]
    },
    {
      "room": "living room",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "master bedroom",
        "common room",
        "balcony",
        "kitchen",
        "bathroom"
      ],
      "directions": [
        "west",
        "west",
        "south",
        "north"
      ]
    },
    {
      "room": "master bedroom",
      "position": "east",
      "dimensions": {},
      "adjacent_rooms": [
        "living room",
        "common room"
      ],
      "directions": [
        "east",
        "east",
        "north"
      ]
    }
  ],
  "total_rooms": 6,
  "raw_text": "The balcony is located on the north side of the floor plan and is north of the living room. It measures approximately 2 feet in length and 15 feet in width and has an area of 30 sq ft. The aspect ratio is 2:15. The bathroom is located on the south side of the floor plan and is south of the living room, north of the kitchen and west of the common room. It measures approximately 8 feet in length and 8 feet in width and has an area of 64 sq ft. The aspect ratio is 1:1. The common room is located on the east side of the floor plan and is east of the living room and south of the master bedroom. It measures approximately 15 feet in length and 10 feet in width and has an area of 150 sq ft. The aspect ratio is 3:2. The kitchen is located on the south side of the floor plan and is south of the living room and south of the bathroom. It measures approximately 15 feet in length and 12 feet in width and has an area of 180 sq ft. The aspect ratio is 5:4. The living room is located on the west side of the floor plan and is west of the master bedroom and common room, south of the balcony and north of the kitchen and bathroom. It measures approximately 35 feet in length and 12 feet in width and has an area of 420 sq ft. The  aspect ratio is 35:12. The master bedroom is located on the east side of the floor plan and is east of the living room and north of the common room. It measures approximately 15 feet in length and 10 feet in width and has an area of 150 sq ft. The aspect ratio is 3:2.",
  "total_square_footage": 0,
  "id": "18983",
  "source_annotation": "data/raw/annotations/18983.txt",
  "source_image": "data/raw/images/18983.png"
}