{
  "rooms": [
    {
      "room": "balcony",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "master room"
      ],
      "directions": [
        "west"
      ]
    },
    {
      "room": "master room",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "bathroom",
        "living room"
      ],
      "directions": [
        "west"
      ]
    },
    {
      "room": "common room",
      "position": "southwest",
      "dimensions": {},
      "adjacent_rooms": [
        "master room",
        "living room"
      ],
      "directions": [
        "southwest",
        "south",
        "west"
      ]
    },
    {
      "room": "kitchen",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "living room"
      ],
      "directions": [
        "north",
        "east",
        "east"
      ]
    },
    {
      "room": "living room",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [],
      "directions": [
        "north"
      ]
    },
    {
      "room": "bathroom",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "kitchen"
      ],
      "directions": [
        "west",
        "east"
      ]
    },
    {
      "room": "living room",
      "position": "middle",
      "dimensions": {},
      "adjacent_rooms": [],
      "directions": [
        "middle"
      ]
    },
    {
      "room": "common room",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "master room",
        "bathroom",
        "living room",
        "bathroom",
        "living room",
        "master room"
      ],
      "directions": [
        "west",
        "west"
      ]
    }
  ],
  "total_rooms": 8,
  "raw_text": "The balcony is located west from the master room, approx. 2 feet wide, and 13 feet long (same as the adjacent master room) The bathroom is located west from the entrance of the apartment and the small corridor (as described in the living room), is of rectangular shape, sized approx. 8x7 feet (W to E wall x N to S wall) The common room is located in the southwest part of the apartment, south from the master room, and west from the living room, it is rectangular and sized approx. 13x9 feet (W to E wall x N to S wall) The kitchen is located in the north-east part of the apartment, east from the entrance to the apartment and the small corridor (as described in the living room), and is rectangular, sized approx. 10x9 feet (W to E wall x N to S wall). The main entrance to the Living room (and into the whole apartment) is from the north side approx. 10 feet from the west wall of the apartment. Upon entrance there is a 5 feet wide corridor towards south, sharing a cca. 7 feet long wall on the west side with the bathroom, and 9 feet long wall on the east side with the kitchen. After the corridor you are in the middle of the open space of the living room sized appox. 25 feet from the western wall (shared with common room and master Master room is located west from the bathroom (and the living room), sharing its west wall half with bathroom, and half with living room (here is probably the entrance to the master room as well, although not indicated in the floor plan). The shape of the room is rectangular and the room size is 13x11 feet (W to E wall x N to S wall).",
  "total_square_footage": 0,
  "id": "40455",
  "source_annotation": "data/raw/annotations/40455.txt",
  "source_image": "data/raw/images/40455.png"
}