{
  "rooms": [
    {
      "room": "bathroom",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "master room"
      ],
      "directions": [
        "south",
        "west"
      ]
    },
    {
      "room": "kitchen",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "master room"
      ],
      "directions": [
        "north",
        "west"
      ]
    },
    {
      "room": "kitchen",
      "position": null,
      "dimensions": {},
      "adjacent_rooms": [
        "master room",
        "master room",
        "bathroom",
        "master room"
      ],
      "directions": []
    },
    {
      "room": "master room",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "bathroom"
      ],
      "directions": [
        "south",
        "south",
        "east"
      ]
    },
    {
      "room": "master room",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "master room"
      ],
      "directions": [
        "north",
        "east"
      ]
    },
    {
      "room": "master room",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "kitchen",
        "master room"
      ],
      "directions": [
        "north"
      ]
    }
  ],
  "total_rooms": 6,
  "raw_text": "The bathroom situated at the south west corner of the floor plan by the left side of the master room 1 and its beneath the livingroom.  It has a vertical length of about 11 feet and a horizontal width of about 6 feet The kitchen is positioned at the north west corner of the floor plan by the left side of the master room 3. It has an area size of about 64 sqrt feet The livingroom is centrally located on the floor plan across the west to east  region of the plan.  It is sandwiched between the kitchen,  master room 3 and master room 2 by the upper side and by the bathroom and master room 1 below.  It has an horizontal length of about 25 feet and a vertical width of about 15 feet The master room 1 is located and covers the south central to the south east corner of the floor plan by the right side of the bathroom. It has an horizontal length of about 18 feet and a vertical width of about 11 feet The master room 2 is located at the north east corner of the floor plan by the right side of the master room 3. It has a horizontal length of about 11 feet and a vertical width of about 8 feet The master room 3 is positioned at the north central region of the floor plan sandwiched between the kitchen by the left and the master room 3 by the right.  It has a horizontal length of about 9 feet and a vertical width of about 8 feet",
  "total_square_footage": 0,
  "id": "45900",
  "source_annotation": "data/raw/annotations/45900.txt",
  "source_image": "data/raw/images/45900.png"
}