{
  "rooms": [
    {
      "room": "balcony",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "bathroom",
        "common room",
        "master room"
      ],
      "directions": [
        "south",
        "west",
        "east",
        "north",
        "south"
      ]
    },
    {
      "room": "common room",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "common room",
        "common room",
        "common room",
        "kitchen"
      ],
      "directions": [
        "north",
        "east",
        "north"
      ]
    },
    {
      "room": "kitchen",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "common room"
      ],
      "directions": [
        "north",
        "west"
      ]
    },
    {
      "room": "living room",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "kitchen",
        "common room",
        "balcony"
      ],
      "directions": [
        "south",
        "north",
        "south"
      ]
    },
    {
      "room": "master room",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [
        "bathroom"
      ],
      "directions": [
        "south",
        "east"
      ]
    }
  ],
  "total_rooms": 5,
  "raw_text": "The balcony is positioned at the south west corner of the floor plan just below the livingroom and it has a horizontal length of about 18 feet and a vertical width of about 3 feet The bathroom is located at the east central region of the floor plan Sandwiched between the common room 1 at the north side and master room at the south side. It has an area size of about 56 sqrt feet The common room 1 is located at the north east corner of the floor plan by the right side of the common room 2 and it has a vertical length of about 13 feet and a horizontal width of about 12 feet The common room 2 is located at the north central region of the floor plan sandwiched between the common room 1 at the right side and the kitchen by the left side.  It has a vertical length of about 13 feet and a horizontal width of about 8 feet The kitchen is positioned at the north west corner of the floor plan by the left side of the common room 2. It has a horizontal length of about 13 feet and a vertical width of about 10 feet The living room is covers the central region towards the south western coast of the floor plan, it is between the kitchen and common room 2 by the north side and the balcony by the south side.  It has a vertical length of about 25 feet and a horizontal width of about 18 feet The master room is situated at the south east corner of the floor plan by the right side of the livingroom and below the bathroom. It has a vertical length of about 18 feet and a horizontal width of about 12 feet",
  "total_square_footage": 0,
  "id": "46443",
  "source_annotation": "data/raw/annotations/46443.txt",
  "source_image": "data/raw/images/46443.png"
}