{
  "rooms": [
    {
      "room": "bathroom",
      "position": "west",
      "dimensions": {},
      "adjacent_rooms": [
        "common room",
        "master room"
      ],
      "directions": [
        "west"
      ]
    },
    {
      "room": "bathroom",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "common room",
        "kitchen"
      ],
      "directions": [
        "north"
      ]
    },
    {
      "room": "common room",
      "position": "south",
      "dimensions": {},
      "adjacent_rooms": [],
      "directions": [
        "south"
      ]
    },
    {
      "room": "common room",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "kitchen",
        "bathroom"
      ],
      "directions": [
        "north",
        "west"
      ]
    },
    {
      "room": "kitchen",
      "position": "north",
      "dimensions": {},
      "adjacent_rooms": [
        "living room",
        "common room",
        "master room",
        "common room"
      ],
      "directions": [
        "north",
        "east",
        "south",
        "west"
      ]
    }
  ],
  "total_rooms": 5,
  "raw_text": "The bathroom 1 is situated at the west side of the floor plan sandwiched between the common room and the master room. It has an area size of 36 sqrt feet The bathroom 2 is positioned near the north side of the floor plan sandwiched between the common room, kitchen and the livingroom. It has the area size of 8 sqrt feet The common room is located at the south side of the floor plan in between the master and the livingroom. Its lenght is 18 feet a d its width is 9 feet The common room 2 is found at the north west of the floor plan next to the kitchen and the bathroom 2 by the left. Its area size is 49 sqrt feet The kitchen is found at the north side of the floor next to left side of the livingroom with an area size of 40 sqrt feet The living room is located at the east side of the floor plan, it is next to the right side of the common room 1 with a lenght of 30 feet and width of 12 feet The master room is located at the south west side of the floor plan next to the common room 1 with a lenght of 15 feet and width of 11 feet",
  "total_square_footage": 0,
  "id": "59431",
  "source_annotation": "data/raw/annotations/59431.txt",
  "source_image": "data/raw/images/59431.png"
}